bilibiliLight/uboot/board/nuvoton/nuc970evb/nuc972_pwm.c
/**************************************************************************//**
 * @file     pwm.c
 * @version  V1.00
 * $Revision: 5 $
 * $Date: 15/06/11 7:32p $
 * @brief    NUC970 series PWM driver source file
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "nuc970.h"
#include "nuc972_pwm.h"
#include <common.h>
/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_PWM_Driver PWM Driver
  @{
*/


/** @addtogroup NUC970_PWM_EXPORTED_FUNCTIONS PWM Exported Functions
  @{
*/

//Internal function definition
/// @cond HIDDEN_SYMBOLS

void pwmISR(PVOID pvParam);


static INT pwmInitGPIO(const INT nTimerIdentity, const INT nValue);
static INT pwmInitTimer(const INT nTimerIdentity);
static INT pwmStartTimer(const INT nTimerIdentity);
static INT pwmStopTimer(const INT nTimerIdentity, const INT nMethod);
// Register operation
static INT pwmSetCP(const INT nTimerIdentity, const INT nValue);
static INT pwmSetDZI(const INT nTimerIdentity, const INT nValue);
static INT pwmSetCSR(const INT nTimerIdentity, const INT nValue);
static INT pwmSetDZGenerator(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetTimerState(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetInverter(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetMode(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetCNR(const INT nTimerIdentity, const INT nValue);
static INT pwmSetCMR(const INT nTimerIdentity, const INT nValue);
static UINT pwmGetPDR(const INT nTimerIdentity);
static INT pwmSetPIER(const INT nTimerIdentity, const INT value);
static INT pwmCleanPIIR(const INT nTimerIdentity);

//Global variable
static __attribute((aligned(4))) BOOL bPWMIRQFlag=FALSE;  //IRQ enable flag, set after PWM IRQ enable
static __attribute((aligned(4))) BOOL bPWMTimerOpenStatus[PWM_TIMER_NUM]; //timer flag which set after open(for disable IRQ decision)
static __attribute((aligned(4))) BOOL bPWMTimerStartStatus[PWM_TIMER_NUM]; //timer flag which set after Start count(to avoid incorrectly stop procedure)
static __attribute((aligned(4))) BOOL bPWMTimerMode[PWM_TIMER_NUM]; //PWM timer toggle/one shot mode
static __attribute((aligned(4))) BOOL volatile bPWMIntFlag[PWM_TIMER_NUM]; //interrupt flag which set by ISR
/// @endcond /* HIDDEN_SYMBOLS */

//----------lzy modify
#define IRQ_LEVEL_1 1
#define PWM_IRQn    1
#define ENABLE_IRQ  1
void sysInstallISR(INT irq_level, INT pwm_irq, PVOID pwm_isr){}
void sysSetLocalInterrupt(INT irq_en){}
void sysEnableInterrupt(INT pwm_irq){}
void sysDisableInterrupt(INT pwm_irq){}
//--------------------

INT PWM_Timer(INT timer_num)
{
    typePWMVALUE pwmvalue;
    typePWMSTATUS PWMSTATUS;
    INT nLoop=0;
    INT nStatus=0;
    INT nInterruptInterval=0;
    PWMSTATUS.PDR=0;
    PWMSTATUS.InterruptFlag=FALSE;

    pwmInit();
    pwmOpen(timer_num);

    // Change PWM Timer setting
    pwmIoctl(timer_num, SET_CSR, 0, CSRD16);
    pwmIoctl(timer_num, SET_CP, 0, 249);
    pwmIoctl(timer_num, SET_DZI, 0, 0);
    pwmIoctl(timer_num, SET_INVERTER, 0, PWM_INVOFF);
    pwmIoctl(timer_num, SET_MODE, 0, PWM_TOGGLE);
    pwmIoctl(timer_num, DISABLE_DZ_GENERATOR, 0, 0);
    if(timer_num == PWM_TIMER0)
    {
        //pwmIoctl(timer_num, ENABLE_PWMGPIOOUTPUT, PWM_TIMER0, PWM0_GPA12);
        pwmIoctl(timer_num, ENABLE_PWMGPIOOUTPUT, PWM_TIMER0, PWM0_GPD12);
    }
    else if(timer_num == PWM_TIMER1)
    {
        //pwmIoctl(timer_num, ENABLE_PWMGPIOOUTPUT, PWM_TIMER1, PWM1_GPA13);
        pwmIoctl(timer_num, ENABLE_PWMGPIOOUTPUT, PWM_TIMER1, PWM1_GPB3);
    }
    else if(timer_num == PWM_TIMER2)
        pwmIoctl(timer_num, ENABLE_PWMGPIOOUTPUT, PWM_TIMER2, PWM2_GPA14);
    else
        pwmIoctl(timer_num, ENABLE_PWMGPIOOUTPUT, PWM_TIMER3, PWM3_GPA15);

    //pwmvalue.field.cnr=59999;
    //pwmvalue.field.cmr=4999;
    pwmvalue.field.cnr=5999;
    pwmvalue.field.cmr=2999;
    pwmWrite(timer_num, (PUCHAR)(&pwmvalue), sizeof(pwmvalue));

    printf("PWM Timer%d one shot mode test\nPWM. Timer interrupt will occure soon.", timer_num);

    //Start PWM Timer
    pwmIoctl(timer_num, START_PWMTIMER, 0, 0);

    nStatus=pwmRead(timer_num, (PUCHAR)&PWMSTATUS, sizeof(PWMSTATUS));
    if(nStatus != Successful) {
        printf("PWM read error, ERR CODE:%d",nStatus);
        pwmClose(timer_num);
        return Fail;
    }
    
    return Successful;
}


/**
  * @brief The init function of PWM device driver
  */
INT pwmInit(void)
{
    UINT temp;
    // Enable PWM clock
    temp = inpw(REG_CLK_PCLKEN1);
    temp = temp | 0x8000000;
    outpw(REG_CLK_PCLKEN1, temp);

    sysInstallISR(IRQ_LEVEL_1, PWM_IRQn, (PVOID)pwmISR);
    sysSetLocalInterrupt(ENABLE_IRQ);  // Enable CPSR I bit

    return 0;
}

/**
  * @brief The exit function of PWM device driver
  */
INT pwmExit(void)
{
    return 0;
}

/**
  * @brief The open function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @retval Successful PWM successfully opened
  * @retval pwmTimerBusy PWM timer already open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmOpen(const INT nTimerIdentity)
{
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == TRUE) {
        return pwmTimerBusy;
    }
    if(bPWMIRQFlag == FALSE) {

        sysEnableInterrupt(PWM_IRQn);

        bPWMIRQFlag=TRUE;
    }
    bPWMTimerOpenStatus[nTimerIdentity]=TRUE;

    // Set PWM timer default value(CSR->PPR->PCR->CMR->CNR)
    pwmInitTimer(nTimerIdentity);

    //Enable PIER
    pwmSetPIER(nTimerIdentity, PWM_ENABLE);

    //Reset PIIR
    pwmCleanPIIR(nTimerIdentity);

    //Reset PWM timer start count flag
    bPWMTimerStartStatus[nTimerIdentity] = FALSE;

    return Successful;

