bilibiliLight/uboot/board/nuvoton/nuc970evb/nuc972_pwm.c
}

/**
  * @brief The close function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @retval Successful PWM successfully closed
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmClose(const INT nTimerIdentity)
{
    INT nLoop;
    BOOL uAllTimerClose=TRUE;
    if( nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX ) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return pwmTimerNotOpen;
    }
    bPWMTimerOpenStatus[nTimerIdentity] = FALSE;
    //Check if all timer stop, IRQ can be disable
    for(nLoop=PWM_TIMER_MIN; nLoop<PWM_TIMER_NUM; nLoop++) {
        if(bPWMTimerOpenStatus[nLoop] == TRUE) {
            uAllTimerClose=FALSE;
        }
    }
    //All timer stop, disable IRQs
    if(uAllTimerClose == TRUE) {

        sysDisableInterrupt(PWM_IRQn);
        bPWMIRQFlag=FALSE;
    }

    pwmSetPIER(nTimerIdentity, PWM_DISABLE);
    pwmCleanPIIR(nTimerIdentity);


    return Successful;

}

/**
  * @brief The read function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[out] pucStatusValue The point of typePWMSTATUS
  * @param[in] uLength The length of typePWMSTATUS
  * @retval Successful Read PWM value successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidStructLength Struct length error(struct type error)
  */
INT pwmRead(const INT nTimerIdentity, PUCHAR pucStatusValue, const UINT uLength)
{
    if( nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX ) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return pwmTimerNotOpen;
    }
    if(uLength != sizeof(typePWMSTATUS)) {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }
    if( sizeof(*((typePWMSTATUS *)pucStatusValue)) != sizeof(typePWMSTATUS) ) {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }
    ((typePWMSTATUS *)pucStatusValue)->PDR=pwmGetPDR(nTimerIdentity);
    if(bPWMIntFlag[nTimerIdentity] == TRUE) {
        bPWMIntFlag[nTimerIdentity]=FALSE;
        ((typePWMSTATUS *)pucStatusValue)->InterruptFlag=TRUE;
    } else {
        ((typePWMSTATUS *)pucStatusValue)->InterruptFlag=FALSE;
    }

    return Successful;

}

/**
  * @brief The write function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[in] pucCNRCMRValue The value of CNR and CMR
  * @param[in] uLength For future usage
  * @retval Successful Write PWM setting successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmWrite(const INT nTimerIdentity, PUCHAR pucCNRCMRValue, const UINT uLength)
{
    typePWMVALUE pwmvalue;
    INT nStatus;
    if( nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX ) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return pwmTimerNotOpen;
    }
    if(uLength != sizeof(typePWMVALUE)) {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }
    pwmvalue.value=((typePWMVALUE *)pucCNRCMRValue)->value;
    nStatus=pwmSetCNR(nTimerIdentity, pwmvalue.field.cnr);

    if(nStatus != Successful) {
        return nStatus;
    }
    nStatus=pwmSetCMR(nTimerIdentity, pwmvalue.field.cmr);

    if(nStatus != Successful) {
        return nStatus;
    }
    return Successful;

}

/**
  * @brief The ioctl function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[in] uCommand Ioctl command which indicates different operation
  * @param[in] uIndication Not use in PWM
  * @param[in] uValue The value which use with uCommand
  * @retval Successful PWM ioctl execute successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidIoctlCommand Ioctl command error
  * @retval Others Error according to different uCommand
  */
INT pwmIoctl(const INT nTimerIdentity, const UINT uCommand, const UINT uIndication, UINT uValue)
{
    INT nStatus;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return pwmTimerNotOpen;
    }
    switch(uCommand) {
    case START_PWMTIMER: {
        nStatus=pwmStartTimer(nTimerIdentity);
        break;
    }
    case STOP_PWMTIMER: {
        // default stop method is 2
        nStatus=pwmStopTimer(nTimerIdentity, PWM_STOP_METHOD2);
        break;
    }
    case SET_CSR: {
        nStatus=pwmSetCSR(nTimerIdentity, uValue);
        break;
    }
    case SET_CP: {
        nStatus=pwmSetCP(nTimerIdentity, uValue);
        break;
    }
    case SET_DZI: {
        nStatus=pwmSetDZI(nTimerIdentity, uValue);
        break;
    }
    case SET_INVERTER: {
        nStatus=pwmSetInverter(nTimerIdentity, uValue);
        break;
    }
    case SET_MODE: {
        nStatus=pwmSetMode(nTimerIdentity, uValue);
        break;
    }
    case ENABLE_DZ_GENERATOR: {
        nStatus=pwmSetDZGenerator(nTimerIdentity, PWM_ENABLE);
        break;
    }
    case DISABLE_DZ_GENERATOR: {
        nStatus=pwmSetDZGenerator(nTimerIdentity, PWM_DISABLE);
        break;
    }
    case ENABLE_PWMGPIOOUTPUT: {
        nStatus=pwmInitGPIO(nTimerIdentity, uValue);
        break;
    }
    default: {
        return pwmInvalidIoctlCommand;
    }
    }
    return nStatus;
}


/// @cond HIDDEN_SYMBOLS

/**
  * @brief The interrupt service routines of PWM
  * @param[in] pvParam IRQ Parameter(not use in PWM)
  */
VOID pwmISR(PVOID pvParam)
{
    INT i;

    UINT32 uRegisterValue = 0;
    uRegisterValue = inpw(REG_PWM_PIIR);// Get PIIR value
    for(i = 0; i < PWM_TIMER_NUM ; i++) {
        if(uRegisterValue & (1 << i)) {
            bPWMIntFlag[i] = 1;
            outpw(REG_PWM_PIIR, (1 << i));
        }
    }
}

/**
  * @brief This function set corresponding GPIO as PWM function according to the
  *        parameter nTimerIdentity
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful PWM init GPIO successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidPin PWM output pin setting error
  */
static INT pwmInitGPIO(const INT nTimerIdentity, const INT nValue)
{
    UINT temp=0;

    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nTimerIdentity == PWM_TIMER0) {
        if(nValue == PWM0_GPA12) {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0x000F0000) | 0xD0000;
            outpw(REG_SYS_GPA_MFPH, temp);
        } else if(nValue == PWM0_GPB2) {
            temp = inpw(REG_SYS_GPB_MFPL);
            temp = (temp & ~0xF00) | 0xD00;
            outpw(REG_SYS_GPB_MFPL, temp);
        } else if(nValue == PWM0_GPC14) {
            temp = inpw(REG_SYS_GPC_MFPH);
            temp = (temp & ~0x0F000000) | 0xD000000;
            outpw(REG_SYS_GPC_MFPH, temp);
        } else if(nValue == PWM0_GPD12) {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0x000F0000) | 0xD0000;
            outpw(REG_SYS_GPD_MFPH, temp);
        } else
            return pwmInvalidPin;
    } else if(nTimerIdentity == PWM_TIMER1) {
        if(nValue == PWM1_GPA13) {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0x00F00000) | 0xD00000;
            outpw(REG_SYS_GPA_MFPH, temp);
        } else if(nValue == PWM1_GPB3) {
            temp = inpw(REG_SYS_GPB_MFPL);
            temp = (temp & ~0xF000) | 0xD000;
            outpw(REG_SYS_GPB_MFPL, temp);
        } else if(nValue == PWM1_GPD13) {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0x00F00000) | 0xD00000;
            outpw(REG_SYS_GPD_MFPH, temp);
        } else
            return pwmInvalidPin;
    } else if(nTimerIdentity == PWM_TIMER2) {
        if(nValue == PWM2_GPA14) {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0x0F000000) | 0xD000000;
            outpw(REG_SYS_GPA_MFPH, temp);
        } else if(nValue == PWM2_GPD14) {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0x0F000000) | 0xD000000;
            outpw(REG_SYS_GPD_MFPH, temp);
        } else if(nValue == PWM2_GPH2) {
            temp = inpw(REG_SYS_GPB_MFPL);
            temp = (temp & ~0xF00) | 0xD00;
            outpw(REG_SYS_GPB_MFPL, temp);
        } else
            return pwmInvalidPin;
    } else {
        if(nValue == PWM3_GPA15) {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0xF0000000) | 0xD0000000;
            outpw(REG_SYS_GPA_MFPH, temp);
        } else if(nValue == PWM3_GPD15) {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0xF0000000) | 0xD0000000;
            outpw(REG_SYS_GPD_MFPH, temp);
        } else if(nValue == PWM3_GPH3) {
            temp = inpw(REG_SYS_GPH_MFPL);
            temp = (temp & ~0xF000) | 0xD000;
            outpw(REG_SYS_GPH_MFPL, temp);
        } else
            return pwmInvalidPin;
    }

    return Successful;
}


/**
  * @brief This function initiates PWM timer n and set the default setting to CSR,
  *        PPR, PCR, CNR, CMR
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful PWM init timer successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmInitTimer(const INT nTimerIdentity)
{
    typePPR PWMPPR;
    INT nStatus;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    //Set CSR
    nStatus=pwmSetCSR(nTimerIdentity, DEFAULT_CSR);

